Revit 2027 API
PartMakerMethodToDivideVolumes.GetPlaneOfSketch Method
 Gets the plane of the sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Plane GetPlaneOfSketch()
Public Function GetPlaneOfSketch As Plane
public:
Plane^ GetPlaneOfSketch()
member GetPlaneOfSketch : unit -> Plane
Return Value
Plane
 The plane of the sketch.
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace